Revit 2026 API

# BRepBuilderEdgeGeometry Class

---

An abstract class used by BRepBuilder to represent the geometry of an edge. Specific edge-geometry representations are represented by subclasses.

SystemObject Autodesk.Revit.DBBRepBuilderEdgeGeometry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BRepBuilderEdgeGeometry : IDisposable
```
```vb
Public Class BRepBuilderEdgeGeometry
	Implements IDisposable
```
```cpp
public ref class BRepBuilderEdgeGeometry : IDisposable
```
```fsharp
type BRepBuilderEdgeGeometry =
    class
        interface IDisposable
    end
```

The BRepBuilderEdgeGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Curve) | Construct BRepBuilderEdgeGeometry based on any Revit Curve, including Line and Arc. The curve will be simplified if possible. |
|  | Create(XYZ, XYZ) | Constructs a BRepBuilderEdgeGeometry representing a straight line between the two given points. |
|  | Dispose | Releases all resources used by the BRepBuilderEdgeGeometry |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace